---
type: LayoutRuleFixedDistance
namespace: Autodesk.Revit.DB
version: 2024
members: 3
tags: [revit-api, class]
---

# LayoutRuleFixedDistance

`Autodesk.Revit.DB.LayoutRuleFixedDistance` · Revit 2024 · 3 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | LayoutRuleFixedDistance | — | `public LayoutRuleFixedDistance ( double spacing , BeamSystemJustifyType justifyType )` |
| Property | JustifyType | — | `public BeamSystemJustifyType JustifyType { get ; set ; }` |
| Property | Spacing | — | `public double Spacing { get ; set ; }` |